// kana-data.js

export const HIRAGANA = {
    'あ': 'a', 'い': 'i', 'う': 'u', 'え': 'e', 'お': 'o',
    'か': 'ka', 'き': 'ki', 'く': 'ku', 'け': 'ke', 'こ': 'ko',
    'さ': 'sa', 'し': 'shi', 'す': 'su', 'せ': 'se', 'そ': 'so',
    'た': 'ta', 'ち': 'chi', 'つ': 'tsu', 'て': 'te', 'と': 'to',
    'な': 'na', 'に': 'ni', 'ぬ': 'nu', 'ね': 'ne', 'の': 'no',
    'は': 'ha', 'ひ': 'hi', 'ふ': 'fu', 'へ': 'he', 'ほ': 'ho',
    'ま': 'ma', 'み': 'mi', 'む': 'mu', 'め': 'me', 'も': 'mo',
    'や': 'ya', 'ゆ': 'yu', 'よ': 'yo',
    'ら': 'ra', 'り': 'ri', 'る': 'ru', 'れ': 're', 'ろ': 'ro',
    'わ': 'wa', 'を': 'wo', 'ん': 'n',
    'が': 'ga', 'ぎ': 'gi', 'ぐ': 'gu', 'げ': 'ge', 'ご': 'go',
    'ざ': 'za', 'じ': 'ji', 'ず': 'zu', 'ぜ': 'ze', 'ぞ': 'zo',
    'だ': 'da', 'ぢ': 'ji', 'づ': 'zu', 'で': 'de', 'ど': 'do',
    'ば': 'ba', 'び': 'bi', 'ぶ': 'bu', 'べ': 'be', 'ぼ': 'bo',
    'ぱ': 'pa', 'ぴ': 'pi', 'ぷ': 'pu', 'ぺ': 'pe', 'ぽ': 'po'
  };
  
  export const KATAKANA = {
    'ア': 'a', 'イ': 'i', 'ウ': 'u', 'エ': 'e', 'オ': 'o',
    'カ': 'ka', 'キ': 'ki', 'ク': 'ku', 'ケ': 'ke', 'コ': 'ko',
    'サ': 'sa', 'シ': 'shi', 'ス': 'su', 'セ': 'se', 'ソ': 'so',
    'タ': 'ta', 'チ': 'chi', 'ツ': 'tsu', 'テ': 'te', 'ト': 'to',
    'ナ': 'na', 'ニ': 'ni', 'ヌ': 'nu', 'ネ': 'ne', 'ノ': 'no',
    'ハ': 'ha', 'ヒ': 'hi', 'フ': 'fu', 'ヘ': 'he', 'ホ': 'ho',
    'マ': 'ma', 'ミ': 'mi', 'ム': 'mu', 'メ': 'me', 'モ': 'mo',
    'ヤ': 'ya', 'ユ': 'yu', 'ヨ': 'yo',
    'ラ': 'ra', 'リ': 'ri', 'ル': 'ru', 'レ': 're', 'ロ': 'ro',
    'ワ': 'wa', 'ヲ': 'wo', 'ン': 'n',
    'ガ': 'ga', 'ギ': 'gi', 'グ': 'gu', 'ゲ': 'ge', 'ゴ': 'go',
    'ザ': 'za', 'ジ': 'ji', 'ズ': 'zu', 'ゼ': 'ze', 'ゾ': 'zo',
    'ダ': 'da', 'ヂ': 'ji', 'ヅ': 'zu', 'デ': 'de', 'ド': 'do',
    'バ': 'ba', 'ビ': 'bi', 'ブ': 'bu', 'ベ': 'be', 'ボ': 'bo',
    'パ': 'pa', 'ピ': 'pi', 'プ': 'pu', 'ペ': 'pe', 'ポ': 'po'
  };
  
  export const HIRAGANA_GROUPS = {
    vowels: ['あ', 'い', 'う', 'え', 'お'],
    k_line: ['か', 'き', 'く', 'け', 'こ'],
    s_line: ['さ', 'し', 'す', 'せ', 'そ'],
    t_line: ['た', 'ち', 'つ', 'て', 'と'],
    n_line: ['な', 'に', 'ぬ', 'ね', 'の'],
    h_line: ['は', 'ひ', 'ふ', 'へ', 'ほ'],
    m_line: ['ま', 'み', 'む', 'め', 'も'],
    y_line: ['や', 'ゆ', 'よ'],
    r_line: ['ら', 'り', 'る', 'れ', 'ろ'],
    w_line: ['わ', 'を', 'ん'],
    g_line: ['が', 'ぎ', 'ぐ', 'げ', 'ご'],
    z_line: ['ざ', 'じ', 'ず', 'ぜ', 'ぞ'],
    d_line: ['だ', 'ぢ', 'づ', 'で', 'ど'],
    b_line: ['ば', 'び', 'ぶ', 'べ', 'ぼ'],
    p_line: ['ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ']
  };
  
  export const KATAKANA_GROUPS = {
    vowels: ['ア', 'イ', 'ウ', 'エ', 'オ'],
    k_line: ['カ', 'キ', 'ク', 'ケ', 'コ'],
    s_line: ['サ', 'シ', 'ス', 'セ', 'ソ'],
    t_line: ['タ', 'チ', 'ツ', 'テ', 'ト'],
    n_line: ['ナ', 'ニ', 'ヌ', 'ネ', 'ノ'],
    h_line: ['ハ', 'ヒ', 'フ', 'ヘ', 'ホ'],
    m_line: ['マ', 'ミ', 'ム', 'メ', 'モ'],
    y_line: ['ヤ', 'ユ', 'ヨ'],
    r_line: ['ラ', 'リ', 'ル', 'レ', 'ロ'],
    w_line: ['ワ', 'ヲ', 'ン'],
    g_line: ['ガ', 'ギ', 'グ', 'ゲ', 'ゴ'],
    z_line: ['ザ', 'ジ', 'ズ', 'ゼ', 'ゾ'],
    d_line: ['ダ', 'ヂ', 'ヅ', 'デ', 'ド'],
    b_line: ['バ', 'ビ', 'ブ', 'ベ', 'ボ'],
    p_line: ['パ', 'ピ', 'プ', 'ペ', 'ポ']
  };
  